# history_dates = \
# {'1030': 'В каком году произошло основание города Юрьев (Тарту)?',
#  '1068': 'В каком году произошла битва на реке Альте?',
#  '1097': 'В каком году произошел Любеческий съезд князей?',
#  '1111': 'В каком году произошел поход Владимира Мономаха на половцев?',
#  '1113': 'В каком году произошло восстание в Киеве против ростовщиков?',
#  '1132': 'В каком году произошла смерть Мстислава Великого и началась Раздробленность?',
#  '1136': 'В каком году произошло установление республики в Новгороде?',
#  '1147': 'В каком году произошло первое упоминание Москвы в летописи?',
#  '1169': 'В каком году произошел разгром Киева войсками Андрея Боголюбского?',
#  '1185': 'В каком году произошел поход князя Игоря Новгород-Северского на половцев?',
#  '1206': 'В каком году произошел курултай на котором Тимучин был избран Чингизханом?',
#  '1223': 'В каком году произошла битва на реке Калка?',
#  '1237': 'В каком году войска Батыя разгромили Рязань?',
#  '1238': 'В каком году произошел разгром «злого города» Козельска?',
#  '1240': 'В каком году произошла Невская битва?',
#  '1242': 'В каком году произошло Ледовое побоище на Чудском озере?',
#  '1253': 'В каком году пришла «Неврюева рать», произошло смещение князя Андрея Ярославича и передача ярлыка на Владимирское княжество Александру Невскому?',
#  '1293': 'В каком году на Москву пришла Дюденева рать?',
#  '1301': 'В каком году произошло присоединение Коломны к Москве?',
#  '1302': 'В каком году произошло присоединение Переяславля к Москве?',
#  '1327': 'В каком году произошло антиордынское восстание в Твери?',
#  '1328': 'В каком году произошел перенос митрополичьей кафедры в Москву?',
#  '1367': 'В каком году закончилась постройка Белокаменного кремля в Москве?',
#  '1377': 'В каком году произошла битва на реке Пьяне?',
#  '1378': 'В каком году произошла битва на реке Воже?',
#  '1380': 'В каком году произошла Куликовская битва?',
#  '1382': 'В каком году произошел набег Тохтамыша на Москву?',
#  '1392': 'В каком году произошло присоединение Нижнего Новгорода к Москве?',
#  '1408': 'В каком году произошел поход Едигея на Москву?',
#  '1410': 'В каком году произошла Грюнвальдская битва?',
#  '1439': 'В каком году произошла Флорентийская уния?',
#  '1471': 'В каком году произошла битва на реке Шелони с Новгородом?',
#  '1478': 'В каком году произошло присоединение Новгорода к Москве?',
#  '1480': 'В каком году произошло Стояние на реке Угре?',
#  '1485': 'В каком году произошло присоединение Твери к Москве?',
#  '862': 'В каком году произошло призвание варягов?',
#  '882': 'В каком году произошел захват Олегом Киева, объединение Киева и Новгорода?',
#  '907': 'В каком году произошел первый поход Олега на Царьград?',
#  '945': 'В каком году произошло восстание древлян?',
#  '957': 'В каком году произошло крещение княгини Ольги в Константинополе?',
#  '971': 'В каком году произошла битва при Доростоле?',
#  '980': 'В каком году произошла языческая реформа Владимира?',
#  '988': 'В каком году произошло крещение Руси?',
#  '1497': 'В каком году произошло издание Судебника. Начало закрепощения крестьян',
#  '1500': '111',
#  '1510':'11111',
#
#
#



 }

sorted_dict = dict(sorted(questions_answers_dict.items()))
pprint.pprint(sorted_dict)